todoList/todoList201701.org
#+TITLE: ToDO List 201701

* 概述
每个月开始时会将上月未完成工作迁移过来，将已完成工作删除

* DONE Redis研究[2/2]
- [X] 安装部署[3/3]
  - [X] 本地安装部署 :: 用于本地调试
  - [X] 集群安装部署 :: 用于部署到生产服务器
  - [X] 集群模式 :: 各类集群模式组合研究，找出适合目前业务的组合
- [X] api代码demo[2/2]
  - [X] java api
  - [X] scala api
* DONE ftp服务器性能监视器[3/3]
- [X] 建立连接测试模块
- [X] 创建指定大小的文件
- [X] 数据上传测试模块
* DONE Echarts的研究[2/2]
- [X] 安排前方通知熟悉Echart
- [X] 头脑风暴，结合现有功能看可以使用哪些图表
* DONE kafka研究[6/6]
- [X] 安装部署
  - [X] 本地模式
  - [X] cdh安装部署
- [X] java to kafka
- [X] java from kafka
- [X] streaming to kafka
- [X] streaming from kafka
- [X] flume to kafka
* TODO 平台功能设计[1/2]
- [X] 功能名称
- [ ] 实现方案
* TODO MLLib库学习[3/4]
- [X] 向量学习
- [ ] 推荐系统
- [X] Data types
- [X] Basic statistics
* TODO Jenkins研究[1/2]
- [X] 本地测试环境搭建，熟悉基本操作
- [ ] 应用到生产环境
* DONE 优化after90的样式[1/1]
- [X] ox-twbs研究
* DONE nginx研究[2/2]
- [X] 搭建部署
- [X] 替换tomcat
* TODO kafka应用[0/3]
- [ ] 设计topic
- [ ] 数据入库
- [ ] 数据出库
* TODO redis应用[1/3]
- [X] 部署
- [ ] 设备数据状态入库
- [ ] 设备数据状态出库
