todoList/todoList201701.html
<!doctype html>
<html lang="en">
<head>
<title>ToDO List 201701</title>
<!-- 2017-01-15 Sun 10:52 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="赵光建">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">ToDO List 201701</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
每个月开始时会将上月未完成工作迁移过来，将已完成工作删除
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <span class="label label-default DONE">DONE</span> Redis研究<code>[2/2]</code></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>[X]</code> 安装部署<code>[3/3]</code>
<dl class="org-dl">
<dt> <code>[X]</code> 本地安装部署 </dt><dd>用于本地调试
</dd>
<dt> <code>[X]</code> 集群安装部署 </dt><dd>用于部署到生产服务器
</dd>
<dt> <code>[X]</code> 集群模式 </dt><dd>各类集群模式组合研究，找出适合目前业务的组合
</dd>
</dl>
</li>
<li><code>[X]</code> api代码demo<code>[2/2]</code>
<ul class="org-ul">
<li><code>[X]</code> java api
</li>
<li><code>[X]</code> scala api
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <span class="label label-default DONE">DONE</span> ftp服务器性能监视器<code>[3/3]</code></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><code>[X]</code> 建立连接测试模块
</li>
<li><code>[X]</code> 创建指定大小的文件
</li>
<li><code>[X]</code> 数据上传测试模块
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <span class="label label-default DONE">DONE</span> Echarts的研究<code>[2/2]</code></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><code>[X]</code> 安排前方通知熟悉Echart
</li>
<li><code>[X]</code> 头脑风暴，结合现有功能看可以使用哪些图表
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="label label-default DONE">DONE</span> kafka研究<code>[6/6]</code></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><code>[X]</code> 安装部署
<ul class="org-ul">
<li><code>[X]</code> 本地模式
</li>
<li><code>[X]</code> cdh安装部署
</li>
</ul>
</li>
<li><code>[X]</code> java to kafka
</li>
<li><code>[X]</code> java from kafka
</li>
<li><code>[X]</code> streaming to kafka
</li>
<li><code>[X]</code> streaming from kafka
</li>
<li><code>[X]</code> flume to kafka
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <span class="label label-primary TODO">TODO</span> 平台功能设计<code>[1/2]</code></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>[X]</code> 功能名称
</li>
<li><code>[&#xa0;]</code> 实现方案
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="label label-primary TODO">TODO</span> MLLib库学习<code>[3/4]</code></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>[X]</code> 向量学习
</li>
<li><code>[&#xa0;]</code> 推荐系统
</li>
<li><code>[X]</code> Data types
</li>
<li><code>[X]</code> Basic statistics
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <span class="label label-primary TODO">TODO</span> Jenkins研究<code>[1/2]</code></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><code>[X]</code> 本地测试环境搭建，熟悉基本操作
</li>
<li><code>[&#xa0;]</code> 应用到生产环境
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <span class="label label-default DONE">DONE</span> 优化after90的样式<code>[1/1]</code></h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><code>[X]</code> ox-twbs研究
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <span class="label label-default DONE">DONE</span> nginx研究<code>[2/2]</code></h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><code>[X]</code> 搭建部署
</li>
<li><code>[X]</code> 替换tomcat
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <span class="label label-primary TODO">TODO</span> kafka应用<code>[0/3]</code></h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li><code>[&#xa0;]</code> 设计topic
</li>
<li><code>[&#xa0;]</code> 数据入库
</li>
<li><code>[&#xa0;]</code> 数据出库
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <span class="label label-primary TODO">TODO</span> redis应用<code>[0/2]</code></h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><code>[&#xa0;]</code> 部署
</li>
<li><code>[&#xa0;]</code> 设备数据状态入库
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. 概述</a></li>
<li><a href="#sec-2">2. Redis研究<code>[2/2]</code></a></li>
<li><a href="#sec-3">3. ftp服务器性能监视器<code>[3/3]</code></a></li>
<li><a href="#sec-4">4. Echarts的研究<code>[2/2]</code></a></li>
<li><a href="#sec-5">5. kafka研究<code>[6/6]</code></a></li>
<li><a href="#sec-6">6. 平台功能设计<code>[1/2]</code></a></li>
<li><a href="#sec-7">7. MLLib库学习<code>[3/4]</code></a></li>
<li><a href="#sec-8">8. Jenkins研究<code>[1/2]</code></a></li>
<li><a href="#sec-9">9. 优化after90的样式<code>[1/1]</code></a></li>
<li><a href="#sec-10">10. nginx研究<code>[2/2]</code></a></li>
<li><a href="#sec-11">11. kafka应用<code>[0/3]</code></a></li>
<li><a href="#sec-12">12. redis应用<code>[0/2]</code></a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: 赵光建</p>
<p class="date">Created: 2017-01-15 Sun 10:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.2.10)</p>
</div>
</footer>
</body>
</html>
